app/controllers/api/v1/project_types_controller.rb

SELECT  "project_types".* FROM "project_types" WHERE "project_types"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
---
      def index

        @has_project_types = HasProjectType.where(user_id: @user.id).select(:project_type_id)
        @p =[]
        @has_project_types.each do |s| @p.push(s.project_type_id) end

SELECT  "project_types".* FROM "project_types" WHERE "project_types"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
      def show
        @project_type = ProjectType.find(params[:id])

INSERT INTO "project_types" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "ss"], ["created_at", "2018-09-21 15:37:37.170927"], ["updated_at", "2018-09-21 15:37:37.170927"]]
---
      def create
        @project_type = ProjectType.new(project_type_params)
        if @project_type.save