app/controllers/api/v1/project_fields_controller.rb

SELECT "project_fields".* FROM "project_fields"
---
  def index
    @project_fields = ProjectField.all

SELECT "project_fields".* FROM "project_fields" WHERE "project_fields"."project_type_id" = $1  [["project_type_id", 44]]
---
    def set_project_field
      @project_field = ProjectField.where(project_type_id: params[:id])