app/controllers/api/v1/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["email", "sss@sss.com"], ["LIMIT", 1]]
---
      def create
        user_mail = User.where(email: params[:email]).first