app/controllers/api/v1/users_controller.rb

      def create
        @user = User.new(user_params)
        if @user.save
---
INSERT INTO "users" ("name", "created_at", "updated_at", "token") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "test user"], ["created_at", "2018-09-21 07:05:16.577727"], ["updated_at", "2018-09-21 07:05:16.577727"], ["token", "34a80f7c8371a97d15b07e430b97529e"]]